Ran Plan for project: `seagl` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.production_env.module.matrix-2024.aws_route53_record.dns-a will be created
+ resource "aws_route53_record" "dns-a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "2024.seagl.org"
      + type            = "A"
      + zone_id         = "Z0173878287JIU5M4KB8R"

      + alias {
          + evaluate_target_health = false
          + name                   = "2024.seagl.org"
          + zone_id                = "Z0173878287JIU5M4KB8R"
        }
    }

  # module.production_env.module.matrix-2024.module.vm.aws_route53_record.dns-a will be created
+ resource "aws_route53_record" "dns-a" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "2024-ephemeral.host.seagl.org"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z0173878287JIU5M4KB8R"
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_compute_instance_v2.instance will be created
+ resource "openstack_compute_instance_v2" "instance" {
      + access_ip_v4        = (known after apply)
      + access_ip_v6        = (known after apply)
      + all_metadata        = (known after apply)
      + all_tags            = (known after apply)
      + availability_zone   = (known after apply)
      + created             = (known after apply)
      + flavor_id           = (known after apply)
      + flavor_name         = "m1.medium"
      + force_delete        = false
      + id                  = (known after apply)
      + image_id            = (known after apply)
      + image_name          = (known after apply)
      + key_pair            = "AJ OpenStack bootstrap"
      + name                = "2024-ephemeral"
      + power_state         = "active"
      + region              = (known after apply)
      + security_groups     = [
          + "2024-ephemeral",
        ]
      + stop_before_destroy = false
      + updated             = (known after apply)
      + user_data           = "ce58ac6040dd5ef465c704b49ba6d6600287333a"

      + block_device {
          + delete_on_termination = true
          + destination_type      = "volume"
          + multiattach           = false
          + source_type           = "image"
          + uuid                  = "9883486d-86b1-493c-9bc8-57f9ef78c8c4"
          + volume_size           = 30
        }

      + network {
          + access_network = false
          + fixed_ip_v4    = (known after apply)
          + fixed_ip_v6    = (known after apply)
          + floating_ip    = (known after apply)
          + mac            = (known after apply)
          + name           = "general_servers2"
          + port           = (known after apply)
          + uuid           = (known after apply)
        }
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_networking_secgroup_rule_v2.icmp4-ingress will be created
+ resource "openstack_networking_secgroup_rule_v2" "icmp4-ingress" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = (known after apply)
      + port_range_min    = (known after apply)
      + protocol          = "icmp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_networking_secgroup_rule_v2.ipv4-egress will be created
+ resource "openstack_networking_secgroup_rule_v2" "ipv4-egress" {
      + direction         = "egress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = (known after apply)
      + port_range_min    = (known after apply)
      + protocol          = (known after apply)
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = (known after apply)
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_networking_secgroup_rule_v2.ipv6-egress will be created
+ resource "openstack_networking_secgroup_rule_v2" "ipv6-egress" {
      + direction         = "egress"
      + ethertype         = "IPv6"
      + id                = (known after apply)
      + port_range_max    = (known after apply)
      + port_range_min    = (known after apply)
      + protocol          = (known after apply)
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = (known after apply)
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["22"] will be created
+ resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 22
      + port_range_min    = 22
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["443"] will be created
+ resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 443
      + port_range_min    = 443
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["80"] will be created
+ resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 80
      + port_range_min    = 80
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_networking_secgroup_rule_v2.tcp4-ingress["8448"] will be created
+ resource "openstack_networking_secgroup_rule_v2" "tcp4-ingress" {
      + direction         = "ingress"
      + ethertype         = "IPv4"
      + id                = (known after apply)
      + port_range_max    = 8448
      + port_range_min    = 8448
      + protocol          = "tcp"
      + region            = (known after apply)
      + remote_group_id   = (known after apply)
      + remote_ip_prefix  = "0.0.0.0/0"
      + security_group_id = (known after apply)
      + tenant_id         = (known after apply)
    }

  # module.production_env.module.matrix-2024.module.vm.openstack_networking_secgroup_v2.main-sg will be created
+ resource "openstack_networking_secgroup_v2" "main-sg" {
      + all_tags             = (known after apply)
      + delete_default_rules = true
      + description          = (known after apply)
      + id                   = (known after apply)
      + name                 = "2024-ephemeral"
      + region               = (known after apply)
      + tenant_id            = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.
╷
│ Warning: Argument is deprecated
│ 
│   with provider["registry.terraform.io/terraform-provider-openstack/openstack"],
│   on provider.tf line 30, in provider "openstack":
│   30: provider "openstack" {
│ 
│ Users not using loadbalancer resources can ignore this message. Support for
│ neutron-lbaas will be removed on next major release. Octavia will be the
│ only supported method for loadbalancer resources. Users using octavia will
│ have to remove 'use_octavia' option from the provider configuration block.
│ Users using neutron-lbaas will have to migrate/upgrade to octavia.
│ 
│ (and 5 more similar warnings elsewhere)
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p seagl`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.seagl.org/lock?id=SeaGL%252Fseagl-terraform%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p seagl`
</details>
Plan: 11 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`